const posts = [
  {
  title: "晚上的公園",
  date: "2026-05-20",
  content: "好多大狗中狗在遛主人"
},
  {
  title: "上班了！",
  date: "2026-05-20",
  content: "08:05 影印店的老鼠狗準時上班 開始期待4個小時之後的午餐時間"
},
  {
  title: "今天天氣不錯",
  date: "2026-05-20",
  content: "抹布狗會到處上廁所，他長得越來越像他的主人了"
},
  {
  title: "測試手機發文功能",
  date: "2026-05-19",
  content: "不要跟老鼠狗對視，他就比較不會汪汪汪"
},
  {
  title: "今天天氣不錯",
  date: "2026-05-19",
  content: "### 內文\n\n影印店老鼠狗依然認真看門"
},
  {
    title: "測試我的網頁",
    date: "2026-05-18",
    content: "生活雜記功能上線！"
  },
  {
    title: "早上的公園很多小狗在溜搭",
    date: "2026-05-18",
    content: "他們要上廁所"
  },
  {
    title: "今天我在更新我的網頁",
    date: "2026-05-18",
    content: "我要進步，我是會用ai的人。\nI can't fix stupid,I can't heal jealousy."
  },
  {
    title: "第二篇雜記",
    date: "2026-05-18",
    content: "今天天氣很好，出門走了兩圈，看到路旁的狗在上廁所，也許會帶來好運?"
  },
  {
    title: "第一篇雜記",
    date: "2026-05-18",
    content: "今天天氣很好，出門走了一圈，看到路旁的貓在曬太陽，心情也跟著好起來。"
  }
];
