const posts = [
  {
  title: "一隻機器狗",
  date: "2026-05-28",
  content: "如果我去買一台電腦，模擬一個機器狗，好像可以學到一點東西，應該比scada有用\n\n<img width=\"480\" height=\"480\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/9fdd347b-f98e-4f40-83c5-d9eba9578437\" />"
},
  {
  title: "現在年輕人2",
  date: "2026-05-28",
  content: "現在年輕人不想上班.\n現在年輕人不想結婚.\n現在年輕人不想買房子.\n現在年輕人……\n\n現在有一種老人，整天只會自以為很強，不聽別人講話，不願意進步，不願意學習，不願意改進，整天只會汪汪叫\n\n汪汪汪汪汪汪汪"
},
  {
  title: "現在年輕人",
  date: "2026-05-28",
  content: "會用這句話當開頭的人，很可惜.\n我也不知道他們是嫉妒又或是自卑？\n是惋惜自己的過去？\n還是他們只是在汪汪叫.\n\n這種言論快要跟37度熱天還把老鼠狗拴在門外一樣討厭"
},
  {
  title: "價值1050元的鐵片",
  date: "2026-05-25",
  content: "<img width=\"3024\" height=\"4032\" alt=\"Image\" src=\"https://github.com/user-attachments/assets/4340f73b-bded-477c-a52b-f517b55db554\" />"
},
  {
  title: "早餐店旁邊的公園",
  date: "2026-05-25",
  content: "太晚吃早餐的話就不會遇到幸運狗狗畫面了"
},
  {
  title: "假日騎速可達出門",
  date: "2026-05-24",
  content: "人很多 狗很少 只有便利商店大餐"
},
  {
  title: "有一種浪浪",
  date: "2026-05-24",
  content: "有人餵食，伙食不錯的，只是沒有家，所以當浪浪\n\n有的浪浪甚至有很多很棒的朋友"
},
  {
  title: "睡覺狗",
  date: "2026-05-23",
  content: "一隻狗在睡覺是最溫馨的畫面。狗狗每天睡眠時間差異很大，幼犬可能睡 18-20 小時，成年犬 12-14 小時，老年犬則需要 15-18 小時恢復體力。年齡、品種、活動量和健康狀況都會影響睡眠時間。狗狗尤其喜歡午睡，這是牠們的天性——白天休息幫助恢復精力，是野生祖先留下的習性。如果狗狗睡眠突然大幅增加，需要留意健康狀況。總之，看著狗狗舒服地打盹，正是牠們最自在、最健康的表現。"
},
  {
  title: "不應該在台灣養長毛狗",
  date: "2026-05-23",
  content: "夏天的時候應該把他的毛 剃成像獅子那樣"
},
  {
  title: "超級熱",
  date: "2026-05-23",
  content: "如果狗的舌頭開始變得僵硬 大口喘氣 就是要中暑了，要在陰涼的地方安靜喝水"
},
  {
  title: "好熱喔",
  date: "2026-05-22",
  content: "認知能力應該是可以有意識的提升的才對\n\n有的狗一分鐘就可以學會坐下\n有的狗要十分鐘\n有的要一小時\n有的一整天都學不會"
},
  {
  title: "今天遇到很棒的事情",
  date: "2026-05-22",
  content: "虎斑狗跟主人十五分鐘後再次經過早餐店門口\n\n這隻深色虎斑狗有流線的飛機耳！"
},
  {
  title: "今天天氣不錯",
  date: "2026-05-22",
  content: "吃早餐的時候看到一隻深色虎斑開心狗在散步遛主人"
},
  {
  title: "手機也可以發佈生活雜記",
  date: "2026-05-20",
  content: "這樣好棒，可以把奇特的社會觀察記錄在網站上。"
},
  {
  title: "晚上的公園",
  date: "2026-05-20",
  content: "好多大狗中狗在遛主人"
},
  {
  title: "上班了！",
  date: "2026-05-20",
  content: "08:05 影印店的老鼠狗準時上班 開始期待4個小時之後的午餐時間"
},
  {
  title: "今天天氣不錯",
  date: "2026-05-20",
  content: "抹布狗會到處上廁所，他長得越來越像他的主人了"
},
  {
  title: "測試手機發文功能",
  date: "2026-05-19",
  content: "不要跟老鼠狗對視，他就比較不會汪汪汪"
},
  {
  title: "今天天氣不錯",
  date: "2026-05-19",
  content: "### 內文\n\n影印店老鼠狗依然認真看門"
},
  {
    title: "測試我的網頁",
    date: "2026-05-18",
    content: "生活雜記功能上線！"
  },
  {
    title: "早上的公園很多小狗在溜搭",
    date: "2026-05-18",
    content: "他們要上廁所"
  },
  {
    title: "今天我在更新我的網頁",
    date: "2026-05-18",
    content: "我要進步，我是會用ai的人。\nI can't fix stupid,I can't heal jealousy."
  },
  {
    title: "第二篇雜記",
    date: "2026-05-18",
    content: "今天天氣很好，出門走了兩圈，看到路旁的狗在上廁所，也許會帶來好運?"
  },
  {
    title: "第一篇雜記",
    date: "2026-05-18",
    content: "今天天氣很好，出門走了一圈，看到路旁的貓在曬太陽，心情也跟著好起來。"
  }
];
